#ifndef IMAGEPRO_ALGOTHRITM
#define IMAGEPRO_ALGOTHRITM


#ifdef __cplusplus
#if __cplusplus
extern "C"
{
#endif
#endif
/***************************************************************************
*【函数名称】：GenHist
*【作者】：凤园迪
*【日期】：2019.2.2
*【函数功能】：生成灰度直方图
*【输入参数】：hist:灰度直方图数组；n:灰度直方图级数
*【返回值】：
*【修订记录】：2019.2.2-------------v1.0首次发行
*
***************************************************************************/
extern bool GenHist(double *hist,int n);
/***************************************************************************
*【函数名称】：LineTran
*【作者】：凤园迪
*【日期】：2019.2.2
*【函数功能】：灰度线性变换
*【输入参数】：hist:灰度直方图数组；n:灰度直方图级数
*【返回值】：
*【修订记录】：2019.2.2-------------v1.0首次发行
*
***************************************************************************/
extern bool LineTran(CImageProcess *imge,double dFba,double dFb);
/***************************************************************************
*【函数名称】：LogTran
*【作者】：凤园迪
*【日期】：2019.2.2
*【函数功能】：灰度对数变换
*【输入参数】：imge:图像数据；dC:灰度变换所需参数 target = dC*Log(Gray)
*【返回值】：
*【修订记录】：2019.2.2-------------v1.0首次发行
***************************************************************************/
extern bool LogTran(CImageProcess *imge,double dC);
/***************************************************************************
*【函数名称】：GammaTran
*【作者】：凤园迪
*【日期】：2019.2.2
*【函数功能】：灰度伽马变换
*【输入参数】：CImageProcess:原始图像数据；:灰度直方图级数
*【返回值】：
*【修订记录】：2019.2.2-------------v1.0首次发行
*
***************************************************************************/
extern bool GammaTran(CImageProcess *imge,double gamma,double comp);
/***************************************************************************
*【函数名称】：Thresold
*【作者】：凤园迪
*【日期】：2019.2.2
*【函数功能】：灰度阈值变换
*【输入参数】：hist:灰度直方图数组；n:灰度直方图级数
*【返回值】：
*【修订记录】：2019.2.2-------------v1.0首次发行
*
***************************************************************************/
extern bool Thresold(CImageProcess *imge,short nThres);

/***************************************************************************
*【函数名称】：ParLineTran
*【作者】：凤园迪
*【日期】：2019.2.2
*【函数功能】：分段线性变换
*【输入参数】：imge:原始图像数据；argx1,argx2,argy1,argy2:分段线性参数
*【返回值】：
*【修订记录】：2019.2.2-------------v1.0首次发行
*
***************************************************************************/
extern bool ParLineTran(CImageProcess *imge,short argx1,shor argx2,shor argy1,short argy2);
/***************************************************************************
*【函数名称】：Histeq
*【作者】：凤园迪
*【日期】：2019.2.2
*【函数功能】：灰度直方图均衡化
*【输入参数】：imge:原始图像数据；
*【返回值】：
*【修订记录】：2019.2.2-------------v1.0首次发行
*
***************************************************************************/
extern bool Histeq(CImageProcess *imge);

/***************************************************************************
*【函数名称】：Histst
*【作者】：凤园迪
*【日期】：2019.2.2
*【函数功能】：直方图规定化
*【输入参数】：
*【返回值】：
*【修订记录】：2019.2.2-------------v1.0首次发行
*
***************************************************************************/
extern bool Histst(CImageProcess *imge,double *pdstdHist);

#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif


#endif